# FieldName Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Field..::..FieldName Property
Field Class See Also
---
The name of the field.
**Namespace:** Autodesk.Revit.DB.ExtensibleStorage**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public string FieldName { get; }
```

Visual Basic
---
```text
Public ReadOnly Property FieldName As String
	Get
```

Visual C++
---
```text
public:
property String^ FieldName {
	String^ get ();
}
```

# See Also
Field Class
Autodesk.Revit.DB.ExtensibleStorage Namespace